import Popup from "./index.js";

export default class Help extends Popup {
	constructor(parentNode) {
		super(parentNode, `
			.firetext {
				color: rgb(255, 119, 63);
			}
			.content h4 {
				text-indent: 2em;
			}
		`);
		this.setCaption('AI禁将——帮助');
		this.setContent(`
		  <h3>一、简介</h3>
            <h4>此功能页旨在帮助玩家快速筛选武将，并将之移除或加入“禁将列表”。当玩家“确认禁将”后，在“禁将列表”里的武将<span class="firetext">不会在对局中被玩家或AI随机到，但玩家仍然可以通过“自由选将”功能选择到处于“禁将列表”里的武将。</span></h4>
          <br>
          <h3>二、按钮操作说明</h3>  
            <h4>1. “分类方式”下拉菜单：鼠标悬停或点击此菜单的黄色字部分，可以展开菜单并选择任一分类方式。</h4>
            <h4>2. “全（不）选”按钮：点击后，一键选择或取消选中当前页面展示的所有武将（“锁链”出现或消失）。</h4>
            <h4>3. “反选”按钮：当前页面展示的所有武将会切换选中状态。</h4>
            <h4>4. “齿轮”图标按钮：点击打开设置页。</h4>
            <h4>5. “搜索输入框”：输入武将的名称/拼音后，点击“Enter”键或“放大镜”图标搜索基于当前页面的武将。</h4>
            <h4>6. “返回”图标按钮：退出功能页。</h4> 
			<h4>7. “左/右箭头”按钮：点击此按钮，所有的武将包按钮向左/向右移动一次。长按此按钮会持续触发。</h4>
			<h4>8. “武将包”按钮：点击后，会根据当前分类方式、武将包、武将包分类展示对应的武将。</h4>
			<h4>9. “武将包分类”按钮：点击后，会根据当前分类方式、武将包、武将包分类展示对应的武将。</h4>
			<h4>10. “禁将列表”按钮：点击后，展示或取消展示当前页面的所有处于被选中或被加入“小黑屋”武将。</h4>
			<h4>11. “确认禁将”按钮：点击后，将所有被选中的武将（包括其他页面的）加入“小黑屋”，被加入“小黑屋”才是不能被随机到的武将。</h4>
			<h4>12. “武将”按钮：点击后，该武将会切换自身的选中状态（“锁链”出现或消失）。</h4>
			<h4>13. “半透明武将”按钮：不可点击，不可选中，这是本体或其他扩展的默认禁用武将，故不对其的禁用状态进行更改，仅作展示用。</h4>
          <br>
          <h3>三、键盘和鼠标操作说明</h3>
            <h4>1. “F1”或“Ctrl + H”：触发“帮助”按钮。</h4>
			<h4>2. “Ctrl + A”：触发“全（不）选”按钮。</h4>
			<h4>3. “Ctrl + B”：触发“反选”按钮。</h4>
			<h4>4. “Ctrl + J”：触发“禁将列表”按钮。</h4>
			<h4>5. “Ctrl + S”：触发“确认禁将”按钮。</h4>
			<h4>6. “Ctrl + F”：“搜索输入框”聚焦。</h4>
			<h4>7. “Ctrl + T”：触发“齿轮”图标按钮。</h4>
			<h4>8. “Ctrl + 鼠标滚轮”：对功能页进行缩放。</h4>
			<h4>9. “Esc”：触发“返回”图标按钮。</h4>
			<h4>10. 框选操作：鼠标在“武将按钮”旁边的进行拖动，松开鼠标后会选中处于框内的“武将按钮”。</h4>
			<h4>11. “Ctrl + 框选操作”：取消处于框内“武将按钮”的选中状态。</h4>
			<h4>12. “Shift + 框选操作”：取消本次框选。</h4>
          <br>
          <h3>四、其他</h3>
            <h4>1.鸣谢：感谢“缘伴随行”提供的 game.oncePlayAudio 函数。</h4>
            <h4>2.bug反馈：请联系本人。</h4>
          <br>
		`);
	}
}

customElements.define('selector-popup-help', Help);
